<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"024ce4f0f66d9ac563ce9c6a2a61a80881f5d7a6302851fc58db21106d43758c","plan_job_ref":"Job PR Plan #24 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812814481","plan_out_hash":"c76c52668401bf0f9659b2cba8ef2c25f7b7add9cfcd4dfe65d7e42c393a6059","plan_hash":"b4121b835f2f9f56a76f2d96a7422f5f5b0bb4e088c5ea896470a7d489b35416","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

  # local_file.test will be created
+   resource "local_file" "test" {
+       content              = "test"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./test.txt"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #6](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812829526)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>